{"case_id": "curated_026", "seed": {"event": "Intel announces 15% workforce reduction and dividend suspension", "date": "2024-08-01", "domain": "Technology", "context": "Intel announces plans to cut 15,000 jobs (15% of workforce) and suspend its dividend as part of a $10 billion cost-reduction plan after reporting disappointing Q2 earnings with $1.6B loss."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "Intel announces 15% workforce reduction and dividend suspension", "path": ["Intel announces 15% workforce reduction", "Intel stock crashes 19% in after-hours trading, completes early retirement phase"], "timeframe_months": 1, "date": "2024-09-01", "research_summary": "Intel's stock plunges 19-20% in after-hours trading on August 1 after announcing the layoffs and dividend suspension. By late September, employees who opted for early retirement officially leave the company, marking the completion of the voluntary phase. Intel announces majority of remaining layoff notices will be issued in mid-October.", "candidates": [{"event": "Intel stock crashes 19% after announcement, early retirements complete by end of September", "label": 1}, {"event": "Intel stock surges 15% as investors approve cost-cutting measures and turnaround plan", "label": 0}, {"event": "Federal government announces emergency intervention to prevent Intel layoffs", "label": 0}, {"event": "Pat Gelsinger resigns as CEO, board halts all layoff plans indefinitely", "label": 0}]}, {"depth": 2, "parent_event": "Intel stock crashes 19%, early retirements complete by September", "path": ["Intel announces workforce reduction", "Stock crashes, early retirements complete", "Intel issues peak layoff notices mid-October, cuts 1,300 at Oregon site"], "timeframe_months": 2, "date": "2024-10-15", "research_summary": "By mid-October 2024, Intel has passed the halfway mark toward its 15,000 job reduction goal, with over 7,500 positions eliminated through voluntary packages. Peak layoff notices are issued around October 15, with Intel laying off 1,300 staff at its Hillsboro, Oregon R&D site and 272 at its Folsom, California facility.", "candidates": [{"event": "Intel issues peak layoff notices mid-October, eliminates 1,300 jobs at Oregon R&D site", "label": 1}, {"event": "Intel reverses layoff decision after securing $15B emergency government contract", "label": 0}, {"event": "All 15,000 laid-off employees rehired after unexpected Q3 earnings surge", "label": 0}, {"event": "Department of Labor blocks Intel layoffs citing violations of WARN Act", "label": 0}]}, {"depth": 3, "parent_event": "Peak layoff notices issued mid-October", "path": ["Intel workforce reduction", "Early retirements complete", "Peak notices mid-October", "Intel reports Q3 $17B loss, completes most layoffs by year-end"], "timeframe_months": 3, "date": "2024-10-31", "research_summary": "Intel reports Q3 2024 results on October 31 with $13.3B revenue (down 6% YoY) and a massive net loss of $16.99B including $15.9B in impairment charges and $2.8B in restructuring costs. By November, Intel is on track to complete the 15,000 job reduction by year-end as planned, though Q4 shows slight improvement with $14.3B revenue but still operating at loss.", "candidates": [{"event": "Intel reports $17B Q3 loss from restructuring, completes layoffs by year-end 2024", "label": 1}, {"event": "Intel Q3 shows surprise profit, CEO announces rehiring of 5,000 workers", "label": 0}, {"event": "Intel files for Chapter 11 bankruptcy unable to recover from losses", "label": 0}, {"event": "NVIDIA acquires Intel for $50B after restructuring failure becomes evident", "label": 0}]}]}
{"case_id": "curated_027", "seed": {"event": "Bangladesh Prime Minister Sheikh Hasina flees country", "date": "2024-08-05", "domain": "Geopolitics", "context": "Prime Minister Sheikh Hasina resigns and flees Bangladesh to India by helicopter after 15 years in power, following five weeks of protests in which security forces killed 1,400 people."}, "domain": "Geopolitics", "levels": [{"depth": 1, "parent_event": "Bangladesh PM Sheikh Hasina flees country", "path": ["Hasina flees to India August 5", "Parliament dissolved August 6, Muhammad Yunus appointed to lead transition"], "timeframe_months": 1, "date": "2024-08-06", "research_summary": "On August 5 at 2:25 PM, Sheikh Hasina resigns and flees Bangladesh by helicopter to India with her sister after protests turned deadly. The next day, August 6, Bangladesh's parliament is dissolved and Nobel laureate Muhammad Yunus is appointed by mutual consensus among political groups and student protesters to lead the interim administration.", "candidates": [{"event": "Parliament dissolved August 6, Nobel laureate Yunus appointed to lead interim government", "label": 1}, {"event": "Hasina returns within days with Indian military support, violently suppresses opposition", "label": 0}, {"event": "Military junta seizes control, establishes authoritarian rule without civilian leadership", "label": 0}, {"event": "United Nations Security Council imposes international administration of Bangladesh", "label": 0}]}, {"depth": 2, "parent_event": "Yunus appointed to lead transition August 6", "path": ["Hasina flees August 5", "Yunus appointed August 6", "Yunus sworn in August 8, announces reforms must precede elections"], "timeframe_months": 2, "date": "2024-08-08", "research_summary": "Muhammad Yunus is officially sworn in as Chief Adviser of Bangladesh on August 8 by President Mohammed Shahabuddin. An interim government is formed to manage the transition. Yunus announces that dates for new elections have not been set, stating that significant democratic and institutional reforms must be implemented before elections can be held.", "candidates": [{"event": "Yunus sworn in August 8, states reforms must precede elections with no date set", "label": 1}, {"event": "Emergency elections scheduled for September 15 with international observers deployed", "label": 0}, {"event": "Hasina's Awami League wins snap election, she returns as Prime Minister", "label": 0}, {"event": "Civil war erupts between pro- and anti-Hasina factions across Bangladesh", "label": 0}]}, {"depth": 3, "parent_event": "Yunus announces reforms before elections", "path": ["Hasina flees", "Yunus appointed", "Reforms announced", "Bangladesh CID declares Hasina and 260 others fugitives by October"], "timeframe_months": 3, "date": "2024-10-05", "research_summary": "By early October 2024, Bangladesh's Criminal Investigation Department (CID) formally declares former PM Sheikh Hasina and 260 others as 'fugitives' as investigations proceed into violence during the quota protests. Arrest warrants are issued for actions during the protests, and the interim government formally requests Hasina's extradition from India.", "candidates": [{"event": "Bangladesh CID declares Hasina and 260 others fugitives, requests extradition from India", "label": 1}, {"event": "India extradites Hasina to Bangladesh in October, she faces trial immediately", "label": 0}, {"event": "Democratic elections held in October establishing permanent government", "label": 0}, {"event": "Hasina launches government-in-exile from India with regional support", "label": 0}]}]}
{"case_id": "curated_028", "seed": {"event": "Google ruled illegal monopoly in antitrust case", "date": "2024-08-05", "domain": "Technology", "context": "Judge Amit Mehta rules that Google held an illegal monopoly on online search and advertising, concluding that 'Google is a monopolist, and it has acted as one to maintain its monopoly' in violation of Section 2 of the Sherman Act."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "Google ruled illegal monopoly in antitrust case", "path": ["Google ruled illegal monopoly August 5", "Court grants DOJ until December to submit remedy proposals"], "timeframe_months": 1, "date": "2024-09-06", "research_summary": "Following the August 5 landmark ruling in the 277-page opinion, a status conference is held on September 6 where Judge Mehta gives the Department of Justice until December 2024 to submit its proposed remedies for Google's anticompetitive conduct, officially beginning the remedies phase of the case.", "candidates": [{"event": "Status conference September 6 grants DOJ until December for remedy proposals", "label": 1}, {"event": "Google announces voluntary breakup of search and advertising divisions immediately", "label": 0}, {"event": "Appeals court grants emergency stay blocking all enforcement of monopoly ruling", "label": 0}, {"event": "Congress passes emergency legislation preempting judicial remedies entirely", "label": 0}]}, {"depth": 2, "parent_event": "DOJ granted until December for remedy proposals", "path": ["Google ruled monopoly", "DOJ given December deadline", "DOJ proposes structural remedies including potential Chrome divestiture October 8"], "timeframe_months": 2, "date": "2024-10-08", "research_summary": "On October 8, the DOJ submits initial recommendations proposing structural remedies for Google's search engine practices. The proposals include limiting Google's $26B annual default search engine agreements with Apple and other companies, and potentially forcing divestiture of the Chrome browser to break Google's monopoly grip.", "candidates": [{"event": "DOJ proposes structural remedies October 8 including Chrome divestiture and Apple deal limits", "label": 1}, {"event": "DOJ recommends only minor behavioral changes allowing Google to remain intact", "label": 0}, {"event": "Judge Mehta rejects all DOJ proposals before formal submission deadline", "label": 0}, {"event": "Google settles case immediately with $75 billion payment avoiding breakup", "label": 0}]}, {"depth": 3, "parent_event": "DOJ proposes Chrome divestiture and Apple deal limits", "path": ["Google ruled monopoly", "December deadline set", "Chrome divestiture proposed", "15-day remedies trial scheduled for May 2025"], "timeframe_months": 3, "date": "2024-12-01", "research_summary": "By December 2024, the court schedules a comprehensive 15-day remedies trial for May 2025 to hear detailed arguments about appropriate remedies. The trial will determine whether Google must divest Chrome, what restrictions apply to the Apple default search agreement worth billions annually, and what other structural or behavioral changes are required to restore competition.", "candidates": [{"event": "Court schedules comprehensive 15-day remedies trial for May 2025", "label": 1}, {"event": "Google agrees to consent decree accepting all DOJ remedies before trial", "label": 0}, {"event": "Judge issues immediate injunction forcing Chrome sale by December 31, 2024", "label": 0}, {"event": "Presidential executive order halts antitrust proceedings citing national security", "label": 0}]}]}
{"case_id": "curated_029", "seed": {"event": "Telegram founder Pavel Durov arrested in France", "date": "2024-08-24", "domain": "Technology", "context": "Telegram founder Pavel Durov is arrested upon landing at Le Bourget Airport in France as part of a preliminary investigation by French authorities over platform's role in enabling criminal activity."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "Pavel Durov arrested in France", "path": ["Durov arrested August 24", "Durov indicted on 12 charges August 28, released on €5M bail"], "timeframe_months": 1, "date": "2024-08-28", "research_summary": "Pavel Durov is arrested on August 24, 2024 after landing at Le Bourget Airport as part of a preliminary investigation by French National Judicial Police. On August 28, four days after arrest, Durov is formally indicted on 12 charges including complicity in distributing child exploitation material and drug trafficking. He is released on €5 million bail, barred from leaving France, and required to report to police twice weekly.", "candidates": [{"event": "Durov indicted on 12 charges August 28, released on €5M bail with travel restrictions", "label": 1}, {"event": "French court orders Durov's immediate deportation without charges filed", "label": 0}, {"event": "Durov held in detention without bail citing flight risk to Russia or UAE", "label": 0}, {"event": "All charges dropped after Telegram agrees to implement content moderation", "label": 0}]}, {"depth": 2, "parent_event": "Durov indicted, released on bail with restrictions", "path": ["Durov arrested", "Indicted and released on bail", "Telegram implements changes: drops 'People Nearby,' increases moderation"], "timeframe_months": 2, "date": "2024-09-28", "research_summary": "Following the indictment, Telegram begins making policy changes in response to French pressure. The 'People Nearby' feature is dropped, and Telegram starts sharing certain user information with law enforcement in response to valid legal requests. By late September, Telegram's FAQ wording changes to reflect cooperation with authorities, and millions of groups and channels are removed in increased moderation activity.", "candidates": [{"event": "Telegram drops 'People Nearby' feature, increases moderation and law enforcement cooperation", "label": 1}, {"event": "Durov announces Telegram shutdown in Europe effective immediately", "label": 0}, {"event": "Durov flees France violating bail terms, international arrest warrant issued", "label": 0}, {"event": "French prosecutors drop all charges after Telegram implements AI filtering", "label": 0}]}, {"depth": 3, "parent_event": "Telegram implements moderation changes", "path": ["Durov arrested", "Released on bail", "Policy changes implemented", "Investigation continues with no trial date, Durov under judicial supervision"], "timeframe_months": 3, "date": "2024-10-24", "research_summary": "By late October 2024, Durov remains under judicial supervision in France with the investigation ongoing. No trial date has been set despite cooperation and policy changes. According to reporting from March 2025, Durov was eventually allowed to leave France but remains under ongoing judicial requirements to report to French authorities as the case continues.", "candidates": [{"event": "Investigation ongoing through October with no trial date, judicial supervision continues", "label": 1}, {"event": "Trial begins October 15 with Durov facing up to 10 years in prison", "label": 0}, {"event": "Durov convicted in absentia after fleeing to Dubai, sentenced to 8 years", "label": 0}, {"event": "European Court of Justice rules French prosecution violates freedom of expression", "label": 0}]}]}
{"case_id": "curated_030", "seed": {"event": "Brazil bans X (Twitter) nationwide", "date": "2024-08-30", "domain": "Technology", "context": "Brazilian Supreme Court Judge Alexandre de Moraes orders internet providers to block X after Elon Musk refuses to appoint a legal representative and comply with content moderation orders."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "Brazil bans X nationwide", "path": ["Brazil bans X August 30", "Supreme Court panel unanimously upholds ban September 2, imposes $9,104 daily VPN fines"], "timeframe_months": 1, "date": "2024-09-02", "research_summary": "X begins to be suspended in Brazil at approximately 12:10 AM on August 31. On September 2, a five-judge panel of Brazil's Supreme Court unanimously affirms Judge Moraes' ban on X. The order includes daily fines of 50,000 reals ($9,104) for any users attempting to bypass the ban using VPNs, affecting Brazil's 20-40 million X users.", "candidates": [{"event": "Five-judge Supreme Court panel unanimously upholds X ban September 2 with $9K daily VPN fines", "label": 1}, {"event": "Brazilian Congress passes emergency law overriding judge's ban on X", "label": 0}, {"event": "Elon Musk agrees to all demands, X restored to Brazil within 48 hours", "label": 0}, {"event": "Organization of American States sanctions Brazil for censorship violations", "label": 0}]}, {"depth": 2, "parent_event": "Supreme Court upholds ban with VPN fines", "path": ["X banned August 30", "Ban upheld September 2", "X evades ban briefly, Moraes unfreezes Starlink after fine payment"], "timeframe_months": 2, "date": "2024-09-21", "research_summary": "On September 18, X briefly evades the block by rerouting traffic through Cloudflare for Brazilian users. By September 21, Moraes rules X still hasn't fully complied with requirements. On September 13, Moraes unfreezes Starlink's finances after Brazilian government seizes R$18.35 million ($3.34M) from X and Starlink accounts to cover fines, though X remains blocked. By September 27, X proves it has blocked profiles spreading disinformation about 2022 election.", "candidates": [{"event": "X briefly evades ban via Cloudflare, Starlink finances unfrozen after $3.34M fine seizure", "label": 1}, {"event": "Elon Musk launches Starlink-based X access permanently circumventing ban", "label": 0}, {"event": "Brazil expands ban to all Meta platforms citing similar compliance failures", "label": 0}, {"event": "UN Human Rights Council condemns Brazil, demands immediate X restoration", "label": 0}]}, {"depth": 3, "parent_event": "Starlink unfrozen after fines paid", "path": ["X banned", "Ban upheld", "Partial compliance", "X fully complies and ban lifted October 8 after $5.2M settlement"], "timeframe_months": 3, "date": "2024-10-08", "research_summary": "After weeks of resistance, X reverses course and complies with all Brazilian court orders. By late September, X blocks profiles deemed to spread election disinformation and appoints a legal representative in Brazil. On October 8, after X settles $5.2 million in accumulated fines, appoints legal counsel, and deactivates flagged accounts as ordered, Judge Moraes lifts the block and X access is restored to Brazilian users.", "candidates": [{"event": "X fully complies with all demands, ban lifted October 8 after $5.2M fine settlement", "label": 1}, {"event": "Ban extended indefinitely despite X compliance over new content violations", "label": 0}, {"event": "X sues Brazil for $50 billion in damages, refuses voluntary service restoration", "label": 0}, {"event": "Brazil announces permanent ban on X, begins building national social media platform", "label": 0}]}]}
{"case_id": "curated_031", "seed": {"event": "Turkey applies to join BRICS economic bloc", "date": "2024-09-02", "domain": "Geopolitics", "context": "Turkey officially submits its application to join BRICS, becoming the first NATO member country to seek membership in the bloc led by Brazil, Russia, India, China, and South Africa."}, "domain": "Geopolitics", "levels": [{"depth": 1, "parent_event": "Turkey applies to join BRICS", "path": ["Turkey applies to BRICS September 2", "Erdogan attends BRICS summit in Kazan October 22-24 to discuss membership"], "timeframe_months": 1, "date": "2024-10-22", "research_summary": "Turkey formally applies to join BRICS on September 2, 2024, becoming the first NATO member to seek BRICS membership. President Erdogan attends the BRICS summit in Kazan, Russia from October 22-24 where Turkey's membership application is formally discussed. The application creates geopolitical tensions as Turkey straddles its NATO commitments and growing ties with the BRICS bloc.", "candidates": [{"event": "Erdogan attends BRICS summit October 22-24 in Kazan to discuss Turkey's membership", "label": 1}, {"event": "NATO expels Turkey immediately after BRICS application announcement", "label": 0}, {"event": "BRICS grants Turkey full membership at emergency September meeting", "label": 0}, {"event": "EU offers Turkey accelerated membership if it withdraws BRICS application", "label": 0}]}, {"depth": 2, "parent_event": "Erdogan attends BRICS summit in Kazan", "path": ["Turkey applies to BRICS", "Erdogan attends Kazan summit", "BRICS offers Turkey 'partner country' status instead of full membership"], "timeframe_months": 2, "date": "2024-10-23", "research_summary": "At the Kazan summit on October 23, BRICS introduces a new 'partner country' category and offers this status to Turkey rather than full membership. Turkish Trade Minister Omer Bolat confirms the offer, describing it as part of a 'transition process' to join the bloc. The partner status is offered to 13 countries that had applied for full membership, including Turkey.", "candidates": [{"event": "BRICS introduces 'partner country' status, offers it to Turkey on October 23", "label": 1}, {"event": "BRICS unanimously approves Turkey as full member effective January 2025", "label": 0}, {"event": "BRICS rejects Turkey's application citing NATO membership incompatibility", "label": 0}, {"event": "Turkey withdraws BRICS application after NATO threatens Article 5 expulsion", "label": 0}]}, {"depth": 3, "parent_event": "BRICS offers partner status instead of full membership", "path": ["Turkey applies", "Kazan summit", "Partner status offered", "Turkey has not accepted partner status, seeks full membership"], "timeframe_months": 3, "date": "2024-11-13", "research_summary": "By mid-November, an official in Erdogan's AK Party tells Reuters that while partner status was discussed in Kazan, it falls short of Turkey's demands for full membership. Trade Minister Bolat doesn't clarify whether Turkey has accepted the partner status. Turkey remains designated as a 'partner' alongside 12 other countries, rather than achieving the full membership it sought.", "candidates": [{"event": "Turkey has not accepted partner status by mid-November, still seeks full membership", "label": 1}, {"event": "Turkey formally accepts partner status as stepping stone to eventual membership", "label": 0}, {"event": "Turkey rejects BRICS entirely, reaffirms exclusive commitment to NATO alliance", "label": 0}, {"event": "BRICS upgrades Turkey to full member in November after Russia diplomatic push", "label": 0}]}]}
{"case_id": "curated_032", "seed": {"event": "OpenAI launches o1 reasoning model", "date": "2024-09-12", "domain": "Technology", "context": "OpenAI releases o1-preview and o1-mini, the first in its 'o' series of reasoning models that spend time 'thinking' before answering, achieving PhD-level performance on science benchmarks."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "OpenAI launches o1 reasoning model", "path": ["OpenAI launches o1 September 12", "o1 scores 83% on IMO qualifying exam vs GPT-4o's 13%, available to Plus users"], "timeframe_months": 1, "date": "2024-09-12", "research_summary": "OpenAI releases o1-preview and o1-mini on September 12, 2024, marking a breakthrough in AI reasoning capabilities. The model solves 83% of International Mathematics Olympiad qualifying problems versus just 13% for GPT-4o, reaches 89th percentile in competitive programming, and performs at PhD level in physics, chemistry, and biology. Models are immediately available to ChatGPT Plus and Team users.", "candidates": [{"event": "o1 launches September 12 with 83% IMO score vs GPT-4o's 13%, available to Plus users", "label": 1}, {"event": "Independent testing reveals o1 performs worse than GPT-4 on most benchmarks", "label": 0}, {"event": "OpenAI admits o1 results fabricated, retracts model from market entirely", "label": 0}, {"event": "Anthropic sues OpenAI claiming o1 infringes Claude reasoning patent", "label": 0}]}, {"depth": 2, "parent_event": "o1 demonstrates breakthrough reasoning performance", "path": ["o1 launches September 12", "PhD-level performance demonstrated", "Competitors announce rival reasoning models by mid-October"], "timeframe_months": 2, "date": "2024-10-15", "research_summary": "By mid-October 2024, competitors Anthropic and Google respond by touting advanced 'reasoning' capabilities in their own models. GitHub integrates o1-preview into Copilot on launch day September 12. The AI industry enters an intensified competition phase in reasoning AI as OpenAI seeks new funding rounds, with reasoning models becoming the new frontier in the AI arms race.", "candidates": [{"event": "Anthropic and Google tout competing reasoning capabilities by mid-October 2024", "label": 1}, {"event": "All major AI labs abandon reasoning approach after o1 fails in production", "label": 0}, {"event": "U.S. government classifies reasoning AI as weapons technology, bans deployment", "label": 0}, {"event": "o1 achieves AGI designation prompting global AI development pause", "label": 0}]}, {"depth": 3, "parent_event": "Competitors launch rival reasoning models", "path": ["o1 launches", "PhD-level shown", "Competition intensifies", "DeepSeek-R1 matches o1 benchmarks by November, OpenAI raises billions"], "timeframe_months": 3, "date": "2024-11-20", "research_summary": "By November 2024, DeepSeek introduces DeepSeek-R1, a reasoning AI model that matches o1 on AIME and MATH benchmarks. The o1 launch catalyzes OpenAI's fundraising, with the company's valuation increasing substantially. Reasoning models demonstrate clear productivity gains in specialized tasks though haven't caused immediate job displacement as some feared.", "candidates": [{"event": "DeepSeek-R1 matches o1 benchmarks by November, OpenAI raises billions citing o1 success", "label": 1}, {"event": "OpenAI funding round collapses after o1 fails NIST safety evaluations", "label": 0}, {"event": "Microsoft withdraws from OpenAI partnership, develops competing reasoning model", "label": 0}, {"event": "OpenAI files for bankruptcy after o1 training costs exceed revenue by $10B", "label": 0}]}]}
{"case_id": "curated_033", "seed": {"event": "SpaceX Polaris Dawn completes first commercial spacewalk", "date": "2024-09-12", "domain": "Technology", "context": "Jared Isaacman and SpaceX engineer perform first private spacewalk at 435 miles altitude using new EVA suits. Mission tests technologies for Mars missions, reaches highest orbit since Apollo."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "SpaceX Polaris Dawn first commercial spacewalk", "path": ["Polaris Dawn launches September 10", "First commercial spacewalk completed September 12 at 6:12 AM EDT"], "timeframe_months": 1, "date": "2024-09-12", "research_summary": "SpaceX's Falcon 9 launches Polaris Dawn from Kennedy Space Center at 5:23 AM ET on September 10, 2024. The crew reaches 870 miles altitude, the highest orbit since Apollo. On September 12 at 6:12 AM EDT, Jared Isaacman and Sarah Gillis perform the first commercial spacewalk using new SpaceX EVA suits. The extravehicular activity lasts 1 hour 46 minutes, with each spending about 7 minutes outside testing suit mobility.", "candidates": [{"event": "Polaris Dawn launches September 10, completes first commercial spacewalk September 12", "label": 1}, {"event": "Launch scrubbed indefinitely after Falcon 9 upper stage failure", "label": 0}, {"event": "Spacewalk aborted due to suit depressurization, crew returns immediately", "label": 0}, {"event": "NASA files injunction blocking commercial spacewalk as unsafe", "label": 0}]}, {"depth": 2, "parent_event": "First commercial spacewalk completed September 12", "path": ["Launch September 10", "Spacewalk September 12", "Mission validates SpaceX EVA suit design for future Mars missions"], "timeframe_months": 2, "date": "2024-09-13", "research_summary": "The successful spacewalk on September 12 validates SpaceX's new EVA suit technology and commercial spaceflight safety protocols. Isaacman exits at 6:48 AM EDT followed by Gillis at 7:04 AM EDT. Both test suit mobility in vacuum conditions. The mission proves commercial entities can safely conduct EVA operations without government astronauts, advancing SpaceX's Mars mission technology development.", "candidates": [{"event": "Spacewalk validates SpaceX EVA suits and commercial spaceflight safety on September 12", "label": 1}, {"event": "EVA suits fail pressure tests, crew forced to abort remaining mission activities", "label": 0}, {"event": "FAA suspends SpaceX commercial spaceflight license pending investigation", "label": 0}, {"event": "Crew suffers decompression sickness requiring emergency evacuation", "label": 0}]}, {"depth": 3, "parent_event": "SpaceX EVA suits validated for commercial operations", "path": ["Launch September 10", "Spacewalk September 12", "Technology validated", "Capsule splashes down September 15, space tourism market expands"], "timeframe_months": 3, "date": "2024-09-15", "research_summary": "The Dragon capsule Resilience successfully splashes down in the Gulf of Mexico near Florida's Dry Tortugas on September 15 at 3:36:54 AM EDT. The mission's success validates commercial spaceflight capabilities, opens new market opportunities for space tourism including spacewalks, and proves SpaceX's technology readiness for future Mars missions and commercial space stations.", "candidates": [{"event": "Mission ends successfully September 15, validates commercial spacewalk market expansion", "label": 1}, {"event": "Capsule landing fails, crew rescued after emergency ocean ditching", "label": 0}, {"event": "All future commercial spacewalks banned after NASA safety review", "label": 0}, {"event": "Crew unable to return, requires SpaceX rescue mission in October", "label": 0}]}]}
{"case_id": "curated_034", "seed": {"event": "Boeing machinists strike halts 737 MAX production", "date": "2024-09-13", "domain": "Business", "context": "33,000 Boeing workers in Seattle reject contract and strike, halting production of 737 MAX, 777, 767. Company losing $50M daily. Strike lasts 7 weeks."}, "domain": "Business", "levels": [{"depth": 1, "parent_event": "Boeing machinists strike halts production", "path": ["Strike begins September 13", "Workers vote 94.6% to reject 25% wage offer, 96% authorize strike"], "timeframe_months": 1, "date": "2024-09-13", "research_summary": "On September 13, 2024, over 33,000 Boeing machinists in Seattle begin striking after 94.6% vote to reject a contract promising 25% pay raise over four years, and 96% vote to authorize the strike. Production of 737 MAX, 777, and 767 aircraft halts completely. The strike compounds Boeing's ongoing quality and safety crisis, with the company losing an estimated $50 million daily.", "candidates": [{"event": "33,000 workers strike September 13 after rejecting 25% wage offer by 94.6% vote", "label": 1}, {"event": "Boeing and union reach immediate agreement, strike averted", "label": 0}, {"event": "Federal government invokes Taft-Hartley Act forcing workers back", "label": 0}, {"event": "Boeing announces permanent plant closure, moves production to non-union state", "label": 0}]}, {"depth": 2, "parent_event": "Workers reject 25% offer, strike begins", "path": ["Strike begins September 13", "First offer rejected", "Workers reject improved 35% offer on October 23 by 64% vote"], "timeframe_months": 2, "date": "2024-10-23", "research_summary": "By October 23, Boeing improves its offer to a 35% wage increase over four years, but machinists vote to reject it with 64% opposition. The strike continues into its second month, with over 7,500 positions already eliminated through voluntary packages. Boeing's financial losses mount, and the company faces pressure to meet aircraft delivery targets as the strike enters week seven.", "candidates": [{"event": "Workers reject improved 35% wage offer October 23 with 64% voting no", "label": 1}, {"event": "Strike ends in October after workers accept 30% offer with bonuses", "label": 0}, {"event": "Boeing files for bankruptcy protection unable to sustain strike losses", "label": 0}, {"event": "President Biden orders mandatory arbitration ending the strike", "label": 0}]}, {"depth": 3, "parent_event": "35% offer rejected, strike continues", "path": ["Strike begins", "35% rejected", "Workers accept 38% offer November 4, strike ends after 53 days"], "timeframe_months": 3, "date": "2024-11-04", "research_summary": "On November 4, 2024, after 53 days on strike, Boeing machinists vote 59% to accept a contract with 38% wage increases over four years, $12,000 ratification bonus, and enhanced 401(k) contributions. Average annual machinist pay will rise to $119,309 from $75,600. Workers return starting November 6. The strike cost Boeing an estimated $5.5 billion, though pension restoration demands remain unmet.", "candidates": [{"event": "Workers accept 38% wage offer November 4, 53-day strike ends with $12K bonuses", "label": 1}, {"event": "Strike continues through year-end, Boeing unable to deliver any aircraft", "label": 0}, {"event": "Machinists union splits, some workers return creating permanent division", "label": 0}, {"event": "Boeing reaches settlement including full pension restoration demanded by union", "label": 0}]}]}
{"case_id": "curated_035", "seed": {"event": "Trump survives second assassination attempt in Florida", "date": "2024-09-15", "domain": "Politics", "context": "Armed man spotted in bushes at Trump International Golf Club in West Palm Beach. Secret Service fires shots, suspect flees, arrested hours later. Second attempt in 2 months."}, "domain": "Politics", "levels": [{"depth": 1, "parent_event": "Trump survives second assassination attempt", "path": ["Trump assassination attempt September 15", "Secret Service agent spots gunman at 1:31 PM, fires shots, suspect flees"], "timeframe_months": 1, "date": "2024-09-15", "research_summary": "On September 15, 2024, while Trump golfs at his West Palm Beach course, Secret Service agent Robert Fercano spots Ryan Wesley Routh aiming a rifle from bushes approximately 400 yards away at 1:31 PM. The agent fires 4-6 shots, Routh drops his weapon and flees in a vehicle. He is apprehended near Palm City, about 45 miles north, shortly after 2 PM following an urgent BOLO alert.", "candidates": [{"event": "Secret Service spots gunman 1:31 PM, fires shots, suspect arrested within hour", "label": 1}, {"event": "Assassination attempt succeeds, Trump rushed to hospital in critical condition", "label": 0}, {"event": "Secret Service fails to detect threat, Trump escapes unharmed by chance", "label": 0}, {"event": "Suspect identified as foreign agent, triggers international incident", "label": 0}]}, {"depth": 2, "parent_event": "Secret Service fires shots, suspect flees and arrested", "path": ["Attempt September 15", "Suspect arrested", "Ryan Routh charged with two firearms violations September 16"], "timeframe_months": 2, "date": "2024-09-16", "research_summary": "Ryan Wesley Routh is formally identified as the suspect on September 15 evening. On September 16 at 9 AM, Routh appears in court and is initially charged with two federal firearms violations. The incident occurs just two months after Trump survived a previous assassination attempt at a Butler, Pennsylvania rally, raising serious questions about Secret Service protection protocols.", "candidates": [{"event": "Ryan Routh charged with two firearms violations in court September 16", "label": 1}, {"event": "Charges dropped after investigation reveals Secret Service overreaction", "label": 0}, {"event": "Suspect released on bail, disappears triggering national manhunt", "label": 0}, {"event": "Congressional committee immediately votes to defund Secret Service", "label": 0}]}, {"depth": 3, "parent_event": "Routh charged with firearms violations", "path": ["Attempt September 15", "Firearms charges September 16", "Routh indicted on five charges including attempted assassination September 24"], "timeframe_months": 3, "date": "2024-09-24", "research_summary": "On September 24, 2024, Ryan Routh is indicted on five federal charges including attempting to assassinate a presidential candidate. The incident prompts increased Secret Service protection for Trump and questions about adequacy of campaign-era security. Trump continues campaigning with enhanced security protocols. Polling shows minimal impact on the race, with political rhetoric intensifying.", "candidates": [{"event": "Routh indicted September 24 on five charges including attempted assassination", "label": 1}, {"event": "Secret Service Director resigns over security failures in both attempts", "label": 0}, {"event": "Trump suspends campaign indefinitely citing safety concerns", "label": 0}, {"event": "Incident causes 10-point polling shift toward Trump in sympathy vote", "label": 0}]}]}
{"case_id": "curated_036", "seed": {"event": "Hezbollah pager explosions kill dozens across Lebanon", "date": "2024-09-17", "domain": "Geopolitics", "context": "Coordinated explosions of Hezbollah pagers kill 12, injure 3,000+ across Lebanon. Second wave targets walkie-talkies day later. Israeli intelligence suspected of supply chain infiltration operation."}, "domain": "Geopolitics", "levels": [{"depth": 1, "parent_event": "Hezbollah pager explosions across Lebanon", "path": ["Pagers explode September 17", "12 killed, 2,750 injured in coordinated explosions of 5,000 pagers"], "timeframe_months": 1, "date": "2024-09-17", "research_summary": "On September 17, 2024, approximately 5,000 Hezbollah pagers explode simultaneously across Lebanon and Syria, killing 12 and injuring 2,750. The devices, ordered through an intermediary, were produced by Israeli intelligence with batteries containing PETN explosive. The operation represents an unprecedented cyber-kinetic attack exploiting supply chain infiltration. Israel decided to trigger the explosions after concerns the operation might be discovered.", "candidates": [{"event": "5,000 pagers explode September 17 killing 12, injuring 2,750 in supply chain attack", "label": 1}, {"event": "Hezbollah identifies Israeli plot before activation, prevents all casualties", "label": 0}, {"event": "Explosions determined to be accidental battery malfunctions, no Israeli involvement", "label": 0}, {"event": "United Nations deploys peacekeeping force preventing further escalation", "label": 0}]}, {"depth": 2, "parent_event": "Pager explosions kill 12, injure 2,750", "path": ["Pagers explode September 17", "Second wave: walkie-talkies explode September 18 killing 30"], "timeframe_months": 2, "date": "2024-09-18", "research_summary": "On September 18, a second wave strikes as walkie-talkies explode across Lebanon, killing 30 people including civilians. On September 20, Israeli airstrikes kill Hezbollah generals Ibrahim Aqil and Ahmed Wehbe along with at least 29 civilians. Beginning September 23, Israel launches multiple airstrikes across Lebanon killing at least 700 people and displacing nearly 500,000, dramatically escalating the conflict.", "candidates": [{"event": "Walkie-talkies explode September 18 killing 30, Israeli airstrikes begin September 23", "label": 1}, {"event": "Hezbollah launches immediate missile retaliation destroying Tel Aviv", "label": 0}, {"event": "Lebanon declares war on Israel, regional conflict erupts across Middle East", "label": 0}, {"event": "International Criminal Court issues arrest warrants for Israeli officials", "label": 0}]}, {"depth": 3, "parent_event": "Second wave and airstrikes escalate conflict", "path": ["Pagers September 17", "Walkie-talkies September 18", "Airstrikes begin", "Israel invades southern Lebanon October 1, Hezbollah signs ceasefire by November"], "timeframe_months": 3, "date": "2024-10-01", "research_summary": "The pager attacks trigger full-scale war. Israel invades southern Lebanon on October 1 in what it calls a 'targeted and demarcated ground operation.' Most Hezbollah leadership including Hassan Nasrallah are killed in airstrikes. By late November, a battered Hezbollah signs a ceasefire agreement with Israel. The pager explosions marked the turning point that transformed limited cross-border exchanges into full invasion.", "candidates": [{"event": "Israel invades Lebanon October 1, Hezbollah leader killed, ceasefire signed by November", "label": 1}, {"event": "Iran enters war directly, launches full-scale attack on Israel in October", "label": 0}, {"event": "United States deploys ground troops to Lebanon preventing Israeli invasion", "label": 0}, {"event": "Hezbollah defeats Israeli ground forces, maintains control of southern Lebanon", "label": 0}]}]}
{"case_id": "curated_037", "seed": {"event": "Federal Reserve cuts interest rates by 0.5% after 11 rate hikes", "date": "2024-09-18", "domain": "Economics", "context": "Fed makes first rate cut since 2020 with larger-than-expected 50 basis point reduction. Inflation at 2.5%, unemployment at 4.2%. Chair Powell signals shift to protecting jobs over fighting inflation."}, "domain": "Economics", "levels": [{"depth": 1, "parent_event": "Federal Reserve cuts rates by 0.5%", "path": ["Fed cuts rates 0.5% September 18", "First rate cut since 2020, reduces benchmark to 4.75%-5.0% range"], "timeframe_months": 1, "date": "2024-09-18", "research_summary": "On September 18, 2024, the Federal Reserve cuts interest rates by 50 basis points, the first reduction since 2020 and larger than the typical 25 basis point move. The cut lowers the federal funds rate from 5.25%-5.50% to 4.75%-5.0%. With inflation at 2.5% and unemployment at 4.2%, Chair Powell signals a policy shift from fighting inflation to protecting the labor market and supporting economic growth.", "candidates": [{"event": "Fed cuts rates 50 basis points September 18, first reduction since 2020", "label": 1}, {"event": "Fed maintains rates unchanged citing persistent inflation concerns", "label": 0}, {"event": "Fed raises rates another 25 basis points despite slowing economy", "label": 0}, {"event": "Emergency Fed meeting announces 100 basis point cut amid recession fears", "label": 0}]}, {"depth": 2, "parent_event": "First rate cut of 50 basis points September 18", "path": ["50bp cut September 18", "Fed delivers second cut of 25bp in November, rate at 4.5%-4.75%"], "timeframe_months": 2, "date": "2024-11-07", "research_summary": "Following the September 50 basis point cut, the FOMC delivers another 25 basis point cut at its November 7 meeting, lowering rates to 4.5%-4.75%. This marks the second consecutive cut in the easing cycle. The Fed's September statement indicated members expected a half percentage point more in cuts by year-end, and the November action keeps the Fed on that trajectory.", "candidates": [{"event": "Fed cuts another 25 basis points November 7, benchmark rate now 4.5%-4.75%", "label": 1}, {"event": "Fed pauses rate cuts in November citing reacceleration in inflation data", "label": 0}, {"event": "Fed reverses course, raises rates 25bp as inflation rebounds unexpectedly", "label": 0}, {"event": "Emergency rate cut of 75bp announced as unemployment spikes to 5.5%", "label": 0}]}, {"depth": 3, "parent_event": "Second 25bp cut in November", "path": ["50bp September", "25bp November", "Fed cuts third time in December by 25bp, projects only two 2025 cuts"], "timeframe_months": 3, "date": "2024-12-18", "research_summary": "On December 18, 2024, the Federal Reserve announces its third consecutive rate cut, reducing rates by 25 basis points to 4.25%-4.5%. This completes the projected 100 basis points in cuts by year-end as signaled in September. However, the Fed projects only two rate cuts in 2025, down from four previously forecast, suggesting a more cautious easing path ahead as economic data and inflation remain in focus.", "candidates": [{"event": "Fed delivers third 25bp cut December 18, projects only two 2025 cuts vs four prior", "label": 1}, {"event": "Fed keeps rates unchanged in December, signals end of easing cycle", "label": 0}, {"event": "Fed cuts 50bp in December as recession becomes imminent in Q1 2025", "label": 0}, {"event": "Inflation resurges to 4%, Fed announces rate hiking cycle resumption", "label": 0}]}]}
{"case_id": "curated_038", "seed": {"event": "China announces stimulus package to revive property sector", "date": "2024-09-24", "domain": "Economics", "context": "People's Bank of China unveils $278B stimulus including rate cuts, reserve requirement reductions, stock market support. Aims to rescue collapsing property sector. CSI 300 index surges 20% in days."}, "domain": "Economics", "levels": [{"depth": 1, "parent_event": "China announces stimulus package", "path": ["China unveils $278B stimulus September 24", "PBOC cuts RRR by 50bp, lowers downpayment ratios, CSI 300 surges 20%"], "timeframe_months": 1, "date": "2024-09-24", "research_summary": "On September 24, 2024, People's Bank of China Governor Pan Gongsheng announces comprehensive monetary stimulus. The PBOC lowers Required Reserve Ratio by 50 basis points releasing ¥1 trillion ($142.5B) in liquidity, cuts mortgage rates by average 50bp for 50 million households, and reduces second home downpayments from 25% to 15%. The CSI 300 Index records its biggest gain since July 2020, rising 24% in September alone.", "candidates": [{"event": "China announces $278B stimulus September 24, CSI 300 surges 20% with rate cuts", "label": 1}, {"event": "China maintains restrictive monetary policy citing inflation concerns", "label": 0}, {"event": "Property sector stimulus rejected by Communist Party central committee", "label": 0}, {"event": "International Monetary Fund intervenes with emergency lending program", "label": 0}]}, {"depth": 2, "parent_event": "Stimulus announced, markets surge 20%", "path": ["Stimulus September 24", "Markets rally 20%", "PBOC allows first mortgage refinancing September 29, market rally continues"], "timeframe_months": 2, "date": "2024-09-29", "research_summary": "On September 29, the PBOC announces homeowners will be permitted to refinance their first mortgages, offering additional relief. The initial market rally continues with the MSCI China Index returning 24% for September and almost 30% for the year. Chinese equities enter technical bull market territory. However, analysts note October data will be crucial to evaluate actual economic effectiveness beyond market sentiment.", "candidates": [{"event": "PBOC allows mortgage refinancing September 29, equity rally continues into October", "label": 1}, {"event": "Market rally reverses completely by early October, erasing all stimulus gains", "label": 0}, {"event": "Property developers declare mass bankruptcies despite stimulus measures", "label": 0}, {"event": "Capital controls imposed as wealthy Chinese flee stock market", "label": 0}]}, {"depth": 3, "parent_event": "Mortgage refinancing permitted, rally continues", "path": ["Stimulus September 24", "Refinancing September 29", "Rally fades by November, property sales stabilize but don't recover"], "timeframe_months": 3, "date": "2024-11-30", "research_summary": "By late November 2024, the initial market rally fades with momentum waning. Total stimulus estimated at ¥7.5 trillion (6% of GDP) represents significant policy shift. Some consumption data bounces back after the package, and housing market shows signs of soft-landing rather than collapse. However, property sales stabilize without robust recovery, and deflation fears persist. Analysts note stimulus alone insufficient without more aggressive fiscal expansion.", "candidates": [{"event": "Market rally fades by November, property sales stabilize but recovery incomplete", "label": 1}, {"event": "Property sector fully recovers by year-end with home prices rising 15%", "label": 0}, {"event": "Stimulus declared complete failure, China enters deflationary spiral", "label": 0}, {"event": "Second stimulus package of $500B announced in December doubling support", "label": 0}]}]}
{"case_id": "curated_039", "seed": {"event": "Francis Ford Coppola's $120M Megalopolis bombs at box office", "date": "2024-09-27", "domain": "Business", "context": "Self-financed epic opens to $4M domestically after 40-year production. Critical reviews mixed. Coppola sells wine business to fund film. Raises questions about theatrical viability for auteur films."}, "domain": "Business", "levels": [{"depth": 1, "parent_event": "Megalopolis bombs at box office", "path": ["Megalopolis opens September 27", "Film debuts with $4M domestic opening on 1,850 screens, finishing sixth place"], "timeframe_months": 1, "date": "2024-09-27", "research_summary": "Francis Ford Coppola's self-financed epic Megalopolis opens on September 27, 2024 to a disastrous $4 million domestic opening on 1,850 screens, failing to crack the top five and debuting in sixth place. The film cost $120-136 million which Coppola financed by selling his wine business and borrowing against assets. After 40 years in development, the mixed critical reception and poor opening weekend signal commercial disaster.", "candidates": [{"event": "Megalopolis opens September 27 to $4M domestic, sixth place on 1,850 screens", "label": 1}, {"event": "Film becomes surprise hit with $45M opening weekend, critics unanimous praise", "label": 0}, {"event": "Lionsgate pulls film from theaters after one weekend citing total failure", "label": 0}, {"event": "Streaming services enter bidding war for rights, offering $200M", "label": 0}]}, {"depth": 2, "parent_event": "Megalopolis opens to $4M, sixth place finish", "path": ["$4M opening September 27", "International sales add $3.4M, total reaches $7.3M domestic by October"], "timeframe_months": 2, "date": "2024-10-31", "research_summary": "By late October, Megalopolis struggles to gain traction with domestic box office reaching only $7.3 million. International markets add $3.4 million for approximately $10-11 million global total. Lionsgate handled North American distribution after boarding in mid-June, while Goodfellas managed international sales. The film is on track to become one of the biggest commercial failures relative to budget in modern cinema history.", "candidates": [{"event": "Domestic total reaches $7.3M by October, international adds $3.4M for ~$11M global", "label": 1}, {"event": "Word-of-mouth drives October surge, film crosses $100M globally", "label": 0}, {"event": "Coppola announces director's cut adding 90 minutes, re-release planned", "label": 0}, {"event": "Major streaming service acquires rights for $80M recouping losses", "label": 0}]}, {"depth": 3, "parent_event": "Global total reaches ~$11M by October", "path": ["$4M opening", "$11M by October", "Film ends with $14.3M total, Coppola forced to sell luxury watch collection"], "timeframe_months": 3, "date": "2024-12-31", "research_summary": "Megalopolis closes its theatrical run with just $14.3 million global box office against $120-136M budget. Coppola reveals 'I don't have any money because I invested all the money, that I borrowed, to make Megalopolis. It's basically gone.' In December, he announces he will sell seven luxury watches from his personal collection to address financial losses. The failure raises fundamental questions about viability of self-financed auteur films in modern theatrical market.", "candidates": [{"event": "Film totals $14.3M globally, Coppola sells luxury watches to cover losses", "label": 1}, {"event": "Late December re-release generates $50M, partially recouping investment", "label": 0}, {"event": "Coppola files bankruptcy, loses personal assets including vineyard estate", "label": 0}, {"event": "Academy Awards nominations drive box office resurgence in January 2025", "label": 0}]}]}
{"case_id": "curated_040", "seed": {"event": "Anthropic raises $4B from Amazon at $18B valuation", "date": "2024-09-27", "domain": "Technology", "context": "Amazon invests additional $4B in Anthropic for minority stake, total investment reaches $8B. Claude models to train on AWS Trainium chips. Competes with Microsoft-OpenAI and Google's Gemini."}, "domain": "Technology", "levels": [{"depth": 1, "parent_event": "Anthropic raises $4B from Amazon", "path": ["Amazon invests $4B in Anthropic", "Amazon's total investment reaches $8B, AWS becomes primary training partner"], "timeframe_months": 1, "date": "2024-09-27", "research_summary": "In late September 2024, Amazon announces an additional $4 billion investment in Anthropic, bringing total investment to $8 billion under expanded partnership. The September 2023 initial collaboration included $1.25B investment with Amazon Web Services becoming Anthropic's primary cloud provider, followed by $2.75B more in March 2024. Note: The major $4B announcement actually occurred in November 2024, with AWS designated as Anthropic's 'primary training partner' for Claude models using AWS Trainium and Inferentia chips.", "candidates": [{"event": "Amazon announces plans for additional investment bringing total to $8B with AWS as primary partner", "label": 1}, {"event": "Anthropic rejects Amazon investment, chooses Google Cloud partnership instead", "label": 0}, {"event": "Federal Trade Commission blocks Amazon investment citing antitrust concerns", "label": 0}, {"event": "Anthropic files for bankruptcy after burning through initial Amazon funding", "label": 0}]}, {"depth": 2, "parent_event": "Amazon total investment reaches $8B, AWS primary partner", "path": ["Amazon investment announced", "AWS primary partner", "Claude models compete effectively with OpenAI by October"], "timeframe_months": 2, "date": "2024-10-31", "research_summary": "By October 2024, Anthropic's Claude models compete effectively against OpenAI's ChatGPT in the exploding generative AI market. AWS customers gain early access to fine-tune Claude models on proprietary data. Microsoft-backed OpenAI raises $6.6B in October at $157B valuation, demonstrating the intense AI arms race. The FTC sends letters to Amazon, Microsoft and Google requiring explanation of how their AI startup investments impact competitive landscape.", "candidates": [{"event": "Claude competes effectively with ChatGPT by October, FTC investigates AI investments", "label": 1}, {"event": "Claude models banned in EU for safety violations, Amazon investment questioned", "label": 0}, {"event": "Anthropic pivots away from AWS to NVIDIA chips citing performance issues", "label": 0}, {"event": "OpenAI acquires Anthropic for $25B ending competition with ChatGPT", "label": 0}]}, {"depth": 3, "parent_event": "Claude competes effectively, FTC investigates", "path": ["Amazon investment", "Claude competitive", "Amazon completes $8B total investment November, AWS partnership deepens"], "timeframe_months": 3, "date": "2024-11-22", "research_summary": "On November 22, 2024, Amazon officially completes the additional $4 billion investment in Anthropic, bringing confirmed total to $8 billion. Anthropic designates AWS as its 'primary cloud and training partner' and commits to using AWS Trainium and Inferentia chips for training and deploying future foundation models. The partnership validates Anthropic's competitive position while intensifying AI infrastructure competition between AWS, Microsoft Azure, and Google Cloud.", "candidates": [{"event": "Amazon completes $8B investment November 22, Anthropic commits to AWS Trainium chips", "label": 1}, {"event": "Anthropic founders leave to start competing AI company, Amazon investment stranded", "label": 0}, {"event": "Claude achieves AGI breakthrough in November, regulators halt all AI development", "label": 0}, {"event": "Amazon writes down entire $8B investment after Claude fails safety evaluations", "label": 0}]}]}
